{
  "codeSol": "",
  "quizType": "ANSWERS",
  "answers": [
    {
      "answer": "A. Each token is unique while each NFT is not",
      "isCorrect": false
    },
    {
      "answer": "B. Each NFT is unique while each token is not",
      "isCorrect": true
    },
    {
      "answer": "C. NFTs cannot be objects",
      "isCorrect": false
    }
  ],
  "lessonId": "1",
  "codeDef": "",
  "title": "Intro to NFT",
  "quizTitle": "What is the difference between NFTs and Tokens (Coins on Sui)?",
  "content": "In recent years, a groundbreaking technology has taken the art, entertainment, and digital collectibles world by storm - Non-Fungible Tokens, or NFTs. These digital assets have revolutionized the way we think about ownership and authenticity in the digital age.\n\nNFTs are unique digital tokens that are built on blockchain technology, which is the same underlying technology behind cryptocurrencies like Bitcoin and Ethereum. What sets NFTs apart is their individuality; each token represents a one-of-a-kind item, whether it's a piece of digital art, music, video clips, virtual real estate, in-game items, or even tweets and memes. This uniqueness is achieved through cryptographic signatures that verify the token's authenticity and ownership, making it tamper-proof and verifiable on a public ledger.\n\nNFTs have opened up exciting opportunities for artists, creators, and collectors, enabling them to monetize and trade digital creations like never before. They have also sparked discussions about the intersection of technology, ownership, and the future of digital culture. As NFTs continue to evolve and expand into various industries, they are reshaping the way we perceive and interact with digital assets, offering a glimpse into the potential of blockchain technology beyond cryptocurrencies.\n\nNFTs (Non-Fungible Tokens) are represented on the blockchain through a combination of smart contracts and unique identifiers. Here's how it works:\n\n1. Smart Contracts: NFTs are created and managed using smart contracts, which are self-executing agreements with predefined rules and conditions. Smart contracts on blockchain platforms like Ethereum, Binance Smart Chain, and others are responsible for the creation, transfer, and ownership of NFTs. These contracts contain the logic that governs the behavior of NFTs, such as how they can be created, bought, sold, and transferred.\n2. Unique Identifiers: Each NFT has a unique identifier that distinguishes it from all other tokens on the blockchain. This identifier is typically a long string of characters that is associated with the specific NFT. It is often referred to as the \"token ID\" or \"token index.\" This identifier ensures the uniqueness of the NFT and allows it to be easily tracked on the blockchain.\n3. Metadata: NFTs often include metadata, which is additional information about the digital asset linked to the token. Metadata can include details about the creator, a description of the asset, its properties, and a link to the actual digital file (e.g., an image, video, or audio file). Metadata is typically stored off-chain (outside the blockchain) due to size limitations, and a reference to this metadata is included within the NFT's smart contract. This allows users to access and display information about the NFT without storing the entire content on the blockchain.\n4. Ownership and Transfer: The ownership of an NFT is tracked on the blockchain. When an NFT is created, the smart contract records the initial owner's wallet address. When the NFT is transferred to another party, the ownership information in the smart contract is updated to reflect the new owner's wallet address. This transfer process is secure and transparent, as it is recorded on the public ledger of the blockchain.\n5. Interoperability: NFTs are often created and traded on various blockchain platforms, each with its own set of standards (e.g., ERC-721 and ERC-1155 on Ethereum, BEP-721 on Binance Smart Chain). To ensure interoperability between different platforms, certain standards and protocols have emerged, allowing NFTs to be recognized and used across multiple ecosystems. For example, the Ethereum-based NFTs can be supported on various NFT marketplaces and platforms that adhere to the same standards.\n\nOn the Sui blockchain, NFTs are easy to create and manage with objects. Each NFT can be an object, which is already unique and can contain any metadata defined by the creators/developers. We'll talk more about how to implement NFTs on Sui in details in the next lessons."
}
