{
  "codeSol": "",
  "quizType": "ANSWERS",
  "answers": [
    {
      "answer": "They would override each other's NFT data",
      "isCorrect": false
    },
    {
      "answer": "Web UIs, wallets and marketplaces would not be able to support so many different standards",
      "isCorrect": true
    },
    {
      "answer": "Creating a new NFT standard is not allowed by the Sui network",
      "isCorrect": false
    }
  ],
  "lessonId": "3",
  "codeDef": "",
  "title": "Community NFT Standards",
  "quizTitle": "Why is it bad if every developer/creator creates their own NFT standard and functionalities?",
  "content": "Although our simple standard from earlier should work for creating our own SuiFren collections and NFTs, there are two problems with it:\n1. It's not a standard used by other developers/creators. Without an agreed upon standard such as how an NFT's attributes are defined, it'd be hard for wallets (used by users to sign and send transactions to the Sui network) and UIs to know how to display the data correctly.\n2. Developers can't reimplement all the functionalities  every time they create their own NFT collections.\n\nBecause of the above reasons, it makes sense for the community to have a common standard and functionality set for NFTs to make it easier for creators to create collections and have them displayed well by both UIs and wallets without having to do a lot of manual work.\n\nMost of the NFT collections on the Sui network currently use two main standards:\n1. OriginByte: https://github.com/Origin-Byte/nft-protocol. This has the most marketshare of the NFT standards on Sui\n2. Suiet: https://std.suiet.app/\n\nFor the remainder of this course, we'll dive into the OriginByte standard as they have the most functionalities while still allowing very flexible NFT design for game builders and artists. In their own words:\n\n```\nOrigin-Byte is an ecosystem of tools, standards, and smart contracts designed to make life easier for Web3 Game Developers and NFT creators. From simple artwork to complex gaming assets, we want to help you reach the public, and provide on-chain market infrastructure.\n\nThe ecosystem is partitioned into three critical components:\n\nThe NFT standard, encompassing the core Nft, Collection, and Safe types, controlling the lifecycle and properties of each NFT.\nPrimary markets, encompassing Marketplace, Listing, and numerous markets which control the initial minting and sale of NFTs.\nSecondary markets, encompassing principally the Orderbook which allows you to trade existing NFTs.\n```\n\nThese library contracts are all deployed in all Sui networks (testnet, mainnet). The address can be seen in their [Move.toml](https://github.com/Origin-Byte/nft-protocol/tree/main/contracts/nft_protocol). In order to develop with these standard, developers just need to copy the [nft_protocol](https://github.com/Origin-Byte/nft-protocol/tree/main/contracts/nft_protocol) and [permissions](https://github.com/Origin-Byte/nft-protocol/tree/main/contracts/permissions) directories over into their source code, and directly use the modules/functions/struct types provided there. In the next few lessons, we'll give a thorough introduction to all of the functionalities they offer.\n\nCommunity builders are always encouraged to improve and suggest adding functionalities to the existing standards such as OriginByte. Through exploring one specific standard, we hope to show you the \"basic\" set of all functionalities commonly used to construct rich and powerful NFTs in art collections, games and many other types of applications. Even if there are new standards adopted by the community in the feature, most of the concepts and functionalities should still apply and developers should be able to more easily switch to those new standards."
}
