{
  "codeSol": "",
  "quizType": "ANSWERS",
  "answers": [
    {
      "answer": "A. Coin has more functions",
      "isCorrect": false
    },
    {
      "answer": "B. Coin has built-in tracking",
      "isCorrect": false
    },
    {
      "answer": "C. Coin offers full implementation developers can use without writing much code",
      "isCorrect": true
    }
  ],
  "lessonId": "1",
  "codeDef": "",
  "title": "Introduction to Tokens, ERC-20, and Coins",
  "quizTitle": "Why is the Coin standard on Sui better than ERC-20 on EVM chains?",
  "content": [
    "In previous courses, we have covered most of the fundamental concepts that developers need to get started in Move. In this lesson, we will dive into a more practical topic and one of the two most common types of core building blocks in blockchains - Tokens.\n",
    "Tokens play a pivotal role in the world of cryptocurrencies, serving as digital representations of value or assets. They are akin to digital certificates that grant ownership or access to various assets, both tangible and virtual, all recorded securely on a blockchain. One prominent standard for these tokens on the Ethereum blockchain is ERC-20.\n",
    "\n",
    "**Tokens** These digital assets exist solely in electronic form on blockchains, decentralized digital ledgers. They represent something valuable, whether it's a cryptocurrency, a share in a company, a voting right in a decentralized organization, or even a virtual collectible item in a game. Tokens can be transferred or traded on the blockchain, their ownership and transactions transparently recorded. Some tokens, thanks to smart contracts, automate processes like dividend distribution or access to services within specific ecosystems. Initial Coin Offerings (ICOs) often use tokens as a means of fundraising, where investors purchase them with the expectation of future value appreciation.\n",
    "\n",
    "**ERC-20** One of the first specifications of how a Token should be implemented, the ERC-20 standard defines a set of interface functions that tokens on the Ethereum blockchain must adhere to. These functions provide a common framework for interacting with tokens and ensure interoperability between different applications and wallets. Here's a summary of the most important ERC-20 interface functions:\n",
    "1. `totalSupply()`: This function returns the total supply of tokens in circulation.\n",
    "2. `balanceOf(address _owner)`: It allows you to check the balance of tokens owned by a specific Ethereum address.\n",
    "3. `transfer(address _to, uint256 _value)`: This function enables the transfer of a specified amount of tokens from the sender's address to another address.\n",
    "\n",
    "Although the ERC-20 standard is simple to implement, all developers would need to provide their own implementation and end up writing almost the same code again and again. This is due to a limitation in the Ethereum network (and many other EVM networks) that there are no core smart contracts that can serve as libraries for developers to use, similar to the core libraries in many languages such as Java.\n",
    "\n",
    "Sui Move solves this issue by defining the [Coin standard](https://github.com/MystenLabs/sui/blob/main/crates/sui-framework/packages/sui-framework/sources/coin.move) directly at 0x2 and allowing developers to directly define and manage tokens easily without having to rewrite the implementation every time. A Token on the Sui network is called a Coin.\n",
    "\n",
    "Another key design principle in how Coin is designed is to reflect the natural design of money in the real world. When someone receives $1, for example, they can put this $1 into their pocket and retrieve it later. This is not the case with token balances in EVM chains where the balances are all recorded inside the smart contract that defines the USDC token (dollar-pegged token). This centralized balance design more resembles a bank deposit system where all balances are only defined in the bank system. This creates a lot of confusion for users who are new to crypto as they think their wallets (e.g., hardware wallets) actually hold the various tokens inside them.\n",
    "\n",
    "In Sui Move, **Coin** is more natural and easier to understand - when a user receives Coins, the Coins are actually stored in an object (can be thought of as a wallet) that belongs to that user. They can later easily retrieve Coins from this object and use them however they want."
  ]
}
